content/topics/blockchain.md
+++
title = "Blockchain"
draft = false
+++

## Articles {#articles}

-   2022-10-04 ◦ [What Is Ripple? What Is XRP? – Forbes Advisor](https://www.forbes.com/advisor/investing/what-is-ripple-xrp/)
-   2022-10-04 ◦ [Blockchain, explained: what’s a block, what’s a chain, and the tech behind crypto](https://www.theverge.com/22654785/blockchain-explained-cryptocurrency-what-is-stake-nft)


### Bugs {#bugs}

-   2022-10-04 ◦ [Smart Contract Bug Results in $31 Million Loss - Schneier on Security](https://www.schneier.com/blog/archives/2021/12/smart-contract-bug-results-in-31-million-loss.html)
-   2022-10-04 ◦ [Really stupid “smart contract” bug let hackers steal $31 million in digital coin](https://arstechnica.com/information-technology/2021/12/hackers-drain-31-million-from-cryptocurrency-service-monox-finance/)
